---
kind: method
id: M:Autodesk.Revit.UI.RibbonItemData.SetContextualHelp(Autodesk.Revit.UI.ContextualHelp)
source: html/36d0b48a-8100-d656-7867-9d24318bd9c0.htm
---
# Autodesk.Revit.UI.RibbonItemData.SetContextualHelp Method

Sets the contextual help bound with this button data.

## Syntax (C#)
```csharp
public void SetContextualHelp(
	ContextualHelp contextualHelp
)
```

## Parameters
- **contextualHelp** (`Autodesk.Revit.UI.ContextualHelp`) - The contextual help.